Repository: kubernetes-incubator/reference-docs
Catalog: gen-resourcesdocs/po/*/io.k8s.api.batch.v1.po
Languages: fr

source: Standard object's metadata. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata
fr: Meta-données standard d'objet. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata

source: Standard list metadata. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata
fr: Meta-données standard de liste. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata

source: Job represents the configuration of a single job.
fr: Job représente la configuration d'un seul job.

source: Specification of the desired behavior of a job. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status
fr: Spécifications du comportement désiré d'un job. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status

source: Current status of a job. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status
fr: Statut courant d'un job. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status

source: JobCondition describes current state of a job.
fr: JobCondition décrit l'état courant d'un job.

source: Last time the condition was checked.
fr: Dernière fois que la condition a été vérifiée.

source: Last time the condition transit from one status to another.
fr: Dernière fois que la condition est passée d'un statut à un autre.

source: Human readable message indicating details about last transition.
fr: Message lisible par l'homme indiquant les détails de la dernière transition.

source: (brief) reason for the condition's last transition.
fr: Raison (brève) de la dernière transition de la condition.

source: Status of the condition, one of True, False, Unknown.
fr: Statut de la condition, parmi True, False, Unknown.

source: Type of job condition, Complete or Failed.
fr: Type de la condition de job, Complete ou Failed.

source: JobList is a collection of jobs.
fr: JobList est une collection de jobs.

source: items is the list of Jobs.
fr: items est la liste de Jobs.

source: JobSpec describes how the job execution will look like.
fr: JobSpec décrit à quoi ressemblera l'exécution du job.

source: Specifies the duration in seconds relative to the startTime that the job may be continuously active before the system tries to terminate it; value must be positive integer. If a Job is suspended (at creation or through an update), this timer will effectively be stopped and reset when the Job is resumed again.
fr: Spécifie la durée en secondes relativement au startTime pendant laquelle le Job peut être continuellement actif avant que le système essaie de le terminer ; la valeur doit être un entier positif. Si un Job est suspendu (à la création ou via une mise à jour), ce minuteur sera effectivement arrêté, et sera réinitialisé lorsque le Job sera redémarré.

source: Specifies the number of retries before marking this job failed. Defaults to 6
fr: Spécifie le nombre de nouvelles tentatives avant de marquer ce Job comme en échec. La valeur par défaut est 6

source: CompletionMode specifies how Pod completions are tracked. It can be `NonIndexed` (default) or `Indexed`.`NonIndexed` means that the Job is considered complete when there have been .spec.completions successfully completed Pods. Each Pod completion is homologous to each other.`Indexed` means that the Pods of a Job get an associated completion index from 0 to (.spec.completions - 1), available in the annotation batch.kubernetes.io/job-completion-index. The Job is considered complete when there is one successfully completed Pod for each index. When value is `Indexed`, .spec.completions must be specified and `.spec.parallelism` must be less than or equal to 10^5.This field is alpha-level and is only honored by servers that enable the IndexedJob feature gate. More completion modes can be added in the future. If the Job controller observes a mode that it doesn't recognize, the controller skips updates for the Job.
fr: CompletionMode spécifie comment les complétions de Pods sont suivis. Il peut êre `NonIndexed` (par défaut) ou `Indexed`. `NonIndexed` indique que le Job est considéré complet lorsqu'il y a eu .spec.completions Pods complétés avec succès. Toutes les complétions de Pod sont homologues. `Indexed` indique que les Pods d'un Job ont un index de complétion associé, de 0 à (.spec.completions - 1), disponible dans l'annotation batch.kubernetes.io/job-completion-index. Le Job is est considéré complet lorsqu'il y a une complétion de Pod réussie pour chaque index. Lorsque la valeur est `Indexed`, .spec.completions doit être spécifié et `.spec.parallelism` doit être inférieur ou égal à 10^5. Ce champ est en niveau alpha et est pris en compte par les serveurs ayant activé la fonctionnalité IndexedJob. D'autres modes de complétion peuvent êre ajoutés dans le futur. Si le contrôleur de Job observe un mode qu'il ne reconnaît pas, le contrôleur saute les mises à jour pour le Job.

source: Specifies the desired number of successfully finished pods the job should be run with. Setting to nil means that the success of any pod signals the success of all pods, and allows parallelism to have any positive value. Setting to 1 means that parallelism is limited to 1 and the success of that pod signals the success of the job. More info: https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/
fr: Spécifie le nombre désiré de pods terminés avec succès que le job doit exécuter. Une valeur nil indique que le succès de n'importe quel pod signale le succès de tous les pods, et permet à parallelism d'avoir n'importe quelle valeur. Une valeur à 1 indique que parallelism est limité à 1 et que le succès de ce pod signale le succès du job. Plus d'infos : https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/

source: manualSelector controls generation of pod labels and pod selectors. Leave `manualSelector` unset unless you are certain what you are doing. When false or unset, the system pick labels unique to this job and appends those labels to the pod template. When true, the user is responsible for picking unique labels and specifying the selector. Failure to pick a unique label may cause this and other jobs to not function correctly. However, You may see `manualSelector=true` in jobs that were created with the old `extensions/v1beta1` API. More info: https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/#specifying-your-own-pod-selector
fr: manualSelector contrôle la génération des étiquettes et sélecteurs des pods. Laissez `manualSelector` sans valeur à moins de savoir exactement ce que vous faites. Lorsque false ou non défini, le système choisit des étiquettes uniques pour ce job et ajoute ces étiquettes au template de pod. Lorsque true, l'utilisateur a la responsabilité de choisir des étiquettes uniques et de spécifier des sélecteurs. Le choix d'étiquettes non uniques peut rendre ce job et d'autres instables. Cependant, vous pourriez voir `manualSelector=true` dans des jobs ayant été créés avec l'ancienne API `extensions/v1beta1`. Plus d'infos : https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/#specifying-your-own-pod-selector

source: Specifies the maximum desired number of pods the job should run at any given time. The actual number of pods running in steady state will be less than this number when ((.spec.completions - .status.successful) < .spec.parallelism), i.e. when the work left to do is less than max parallelism. More info: https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/
fr: Spécifie le nombre maximum désiré de Pods que le Job doit exécuter à n'importe quel moment. Le nombre effectif de Pods s'exécutant en état stationnaire sera inférieur à ce nombre lorsque ((.spec.completions - .status.successful) < .spec.parallelism), c'est-à-dire lorsque le travail restant à exécuter est inférieur au parallèlisme maximal. Plus d'infos : https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/

source: A label query over pods that should match the pod count. Normally, the system sets this field for you. More info: https://kubernetes.io/docs/concepts/overview/working-with-objects/labels/#label-selectors
fr: Une requête d'étiquettes sur les Pods qui doivent correspondre au nombre de Pods. Normalement, le système renseigne ce champ pour vous. Plus d'infos : https://kubernetes.io/docs/concepts/overview/working-with-objects/labels/#label-selectors

source: Suspend specifies whether the Job controller should create Pods or not. If a Job is created with suspend set to true, no Pods are created by the Job controller. If a Job is suspended after creation (i.e. the flag goes from false to true), the Job controller will delete all active Pods associated with this Job. Users must design their workload to gracefully handle this. Suspending a Job will reset the StartTime field of the Job, effectively resetting the ActiveDeadlineSeconds timer too. This is an alpha field and requires the SuspendJob feature gate to be enabled; otherwise this field may not be set to true. Defaults to false.
fr: Suspend indique si le contrôleur de Job doit ou non créer des Pods. Si un Job est créé avec suspend à true, aucun Pod n'est créé par le contrôleur de Job. Si un Job est suspedu après sa création (c'est-a-dire le drapeau est changé de false à true), le contrôleur de Job va supprimer tous les Pods actifs associés à ce Job. Les utilisateurs doivent concevoir leurs charges de travail pour supporter ce comportement correctement. Suspendre un Job va réinitialiser le champ StartTime du Job, en réinitialisant aussi le minuteur ActiveDeadlineSeconds. Ce champ est en niveau alpha et nécessite que la fonctionnalité SuspendJob soit activée ; dans le cas contraire, ce champ ne devrait pas être mis à true. La valeur par défaut est false.

source: Describes the pod that will be created when executing a job. More info: https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/
fr: Décrit le Pod qui sera créé lors de l'exécution d'unJob. Plus d'infos : https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/

source: ttlSecondsAfterFinished limits the lifetime of a Job that has finished execution (either Complete or Failed). If this field is set, ttlSecondsAfterFinished after the Job finishes, it is eligible to be automatically deleted. When the Job is being deleted, its lifecycle guarantees (e.g. finalizers) will be honored. If this field is unset, the Job won't be automatically deleted. If this field is set to zero, the Job becomes eligible to be deleted immediately after it finishes. This field is alpha-level and is only honored by servers that enable the TTLAfterFinished feature.
fr: ttlSecondsAfterFinished limite la durée de vie d'un Job ayant terminé son exécution (soit Complete, soit Failed). Si ce champ est renseigné, ttlSecondsAfterFinished après que le Job se termine, il est elligible à être supprimé automatiquement. Lorsque le Job est en cours de suppression, ses garanties de cycle de vie (par exemple ses finalizers) seront honorées. Si ce champ n'est pas renseigné, le Job ne sera pas supprimé automatiquement. Si ce champ est mis à zéro, le Job devient elligible à la suppression immédiatement après qu'il se termine. Ce champ est en niveau alpha et est uniquement pris en compte par les serveurs ayant activé la fonctionnalité TTLAfterFinished.

source: JobStatus represents the current state of a Job.
fr: JobStatus représente l'état courant d'un Job.

source: The number of actively running pods.
fr: Le nombre de pods activement en cours d'exécution.

source: CompletedIndexes holds the completed indexes when .spec.completionMode = "Indexed" in a text format. The indexes are represented as decimal integers separated by commas. The numbers are listed in increasing order. Three or more consecutive numbers are compressed and represented by the first and last element of the series, separated by a hyphen. For example, if the completed indexes are 1, 3, 4, 5 and 7, they are represented as "1,3-5,7".
fr: CompletedIndexes contient les indices terminés lorsque .spec.completionMode = "Indexed" dans un format texte. Les indices sont représentés par des entiers décimaux séparés par des virgules. Les nombres sont listés dans l'ordre croissant. Au moins trois nombres consécutifs sont compressés et représentés par le premier et le dernier élément de la série, séparés par un tiret. Par exemple, si les indices terminés sont 1, 3, 4, 5 et 7, ils sont représentés par "1,3-5,7".

source: Represents time when the job was completed. It is not guaranteed to be set in happens-before order across separate operations. It is represented in RFC3339 form and is in UTC. The completion time is only set when the job finishes successfully.
fr: Représente l'heure à laquelle le job termine. Il n'est pas garanti d'être renseigné dans l'ordre d'arrivée à travers plusieurs opérations. Est représenté dans le format RFC3339 en UTC. L'heure de complétion est renseignée uniquement lorsque le job termine avec succès.

source: The latest available observations of an object's current state. When a Job fails, one of the conditions will have type "Failed" and status true. When a Job is suspended, one of the conditions will have type "Suspended" and status true; when the Job is resumed, the status of this condition will become false. When a Job is completed, one of the conditions will have type "Complete" and status true. More info: https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/
fr: Les dernières observations disponibles de l'état courant d'un objet. Lorsqu'un Job échoue, une des conditions aura un type à "Failed" et un statut à true. Lorsqu'un Job est suspendu, une des conditions aura un type à "Suspended" et un statut à true ; lorsque le Job est relancé, le statut de cette condition deviendra false. Lorsqu'un Job est complété, une des conditions aura un type à "Complete" et un statut à true. Plus d'infos : https://kubernetes.io/docs/concepts/workloads/controllers/jobs-run-to-completion/

source: The number of pods which reached phase Failed.
fr: Le nombre de pods ayant atteint la phase Failed.

source: Represents time when the job controller started processing a job. When a Job is created in the suspended state, this field is not set until the first time it is resumed. This field is reset every time a Job is resumed from suspension. It is represented in RFC3339 form and is in UTC.
fr: Représente l'heure à laquelle le contrôleur de job a commencé à gérer un job. Lorsqu'un Job est créé dans un état suspendu, ce champ n'est pas renseigné avant qu'il soit une première fois démarré. Ce champ est réinitialisé chaque fois qu'un Job est relancé suite à une suspension. Représenté au format RFC3339 en UTC.

source: The number of pods which reached phase Succeeded.
fr: Le nombre de pods ayant atteint la phase Succeeded.

source: JobTemplateSpec describes the data a Job should have when created from a template
fr: JobTemplateSpec décrit les données qu'un Job doit avoir lorsqu'il est créé depuis un template

source: Standard object's metadata of the jobs created from this template. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata
fr: Meta-données standard d'objet des jobs créés à partir de ce template. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#metadata

source: Specification of the desired behavior of the job. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status
fr: Spécifications du comportement désiré du job. Plus d'infos : https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#spec-and-status
